<form theme="dark">
  <label>Truvis-Network Intelligence by ENDPOINT [SUB]</label>
  <fieldset submitButton="false">
    <input type="time" token="field1">
      <label></label>
      <default>
        <earliest>-24h@h</earliest>
        <latest>now</latest>
      </default>
    </input>
    <input type="text" token="field2" searchWhenChanged="true">
      <label>Host IP/Hostname</label>
    </input>
  </fieldset>
  <row>
    <panel>
      <chart>
        <title>DNS Queries over time</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns" src_ip="$field2$" | timechart count by src_ip</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="charting.chart">column</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
  </row>
  <row>
    <panel>
      <table>
        <title>Connections to Risky Domains</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns" src_ip="$field2$"
[ | inputlookup domains.csv 
| rename bad_domain as dns.answers{}.rrname | fields dns.answers{}.rrname ] | table _time, src_ip, dns.answers{}.rrname | sort _time desc</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
    <panel>
      <table>
        <title>Connections to Risky IPs</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns" src_ip="$field2$"
[ | inputlookup domains.csv 
| rename bad_domain as dns.answers{}.rrname | fields dns.answers{}.rrname ] | table _time, src_ip, dns.answers{}.rrname | sort _time desc</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <table>
        <title>Risky User-Agents</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns"
[ | inputlookup domains.csv 
| rename bad_domain as dns.answers{}.rrname | fields dns.answers{}.rrname ] | table _time, src_ip, dns.answers{}.rrname | sort _time desc</query>
          <earliest>-24h@h</earliest>
          <latest>now</latest>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
    <panel>
      <table>
        <title>Uncommon User-Agents</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns"
[ | inputlookup domains.csv 
| rename bad_domain as dns.answers{}.rrname | fields dns.answers{}.rrname ] | table _time, src_ip, dns.answers{}.rrname | sort _time desc</query>
          <earliest>-24h@h</earliest>
          <latest>now</latest>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <table>
        <title>User-Agents Seen</title>
        <search>
          <query>index="suricata" sourcetype="suricata:fileinfo" src_ip="$field2$" | stats count by http.http_user_agent | sort count desc</query>
          <earliest>-24h@h</earliest>
          <latest>now</latest>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
    <panel>
      <table>
        <title>Most Active DNS Connections</title>
        <search>
          <query>index="suricata" sourcetype="suricata:dns" src_ip="$field2$"| stats count by dns.answers{}.rrname | sort count desc</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <chart>
        <title>Flow | Proto</title>
        <search>
          <query>index="suricata" sourcetype="suricata:flow" src_ip="$field2$" | stats count by app_proto</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
    <panel>
      <chart>
        <title>Annomalies | Events</title>
        <search>
          <query>index="suricata" sourcetype="suricata:anomaly" src_ip="$field2$" | stats count by anomaly.event</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
    <panel>
      <chart>
        <title>Anomalies | Protot</title>
        <search>
          <query>index="suricata" sourcetype="suricata:anomaly" src_ip="$field2$" | stats count by app_proto</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
  </row>
</form>
